sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
	LedOff();	 



	ctlSource = HMD_SOURCE;
	ctlSource += (GPIO_PIN_SET == HAL_GPIO_ReadPin(CTL_MODE1_GPIO_Port, CTL_MODE1_Pin)?1:0); 
	ctlSource += (GPIO_PIN_SET == HAL_GPIO_ReadPin(CTL_MODE2_GPIO_Port, CTL_MODE2_Pin)?2:0); 	
	srand(ctlSource);


	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET); 
		BlinkRease(30);
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
		HAL_Delay(250);
	}

//	GPIO_InitTypeDef GPIO_InitStruct;
//	GPIO_InitStruct.Pin = I2C_SCL_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
//	HAL_GPIO_Init(I2C_SCL_GPIO_Port, &GPIO_InitStruct);
//	HAL_Delay(10);

//	for (int x=0; x<9;x++)
//	{
//		HAL_GPIO_WritePin(I2C_SCL_GPIO_Port, I2C_SCL_Pin, GPIO_PIN_RESET);
//		HAL_Delay(10);
//		HAL_GPIO_WritePin(I2C_SCL_GPIO_Port, I2C_SCL_Pin, GPIO_PIN_SET);
//		HAL_Delay(10);
//	}
//	
//	HAL_GPIO_DeInit(I2C_SCL_GPIO_Port, I2C_SCL_Pin);
//	HAL_Delay(10);
//	

	rfStatus = TrackedDevice_NRF24L01_Init();	
	if (rfStatus == 0x00 || rfStatus == 0xff)
		Error_Handler();
	LedOff();	
	

	sensorStatus = initSensors();		
	if (!sensorStatus)
		Error_Handler();
	LedOff();		
	
	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET); 
		BlinkRease(20);
		HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
		HAL_Delay(100);
	}
	//bool sensorWarmup = false;
	int extraDelay = ctlSource>HMD_SOURCE? 8:3;
	bool isCalibrated = false;
	bool hasRotationData = false;
	bool hasPositionData = false;
	uint8_t buttonRetransmit = 0;
	//bool hasTriggerData = false;

	tSensorData.Setup(aRes, gRes, mRes);
	
	CSensorFusion orientFuse(0.2f);
	CSensorFusion gravFuse(1.0f);
	
	//do some warmup
	for (int i=0; i<100; i++)
	{
		readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values		
		tSensorData.Accel.ProcessNew();
		HAL_Delay(1);
		readGyroData(tSensorData.Gyro.Raw); 
		tSensorData.Gyro.ProcessNew();
		HAL_Delay(1);
		readMagData(tSensorData.Mag.Raw);
		tSensorData.Mag.ProcessNew();
		HAL_Delay(10);
	}
	
//	float s = 0.9f;
//	tSensorData.HighPassVelocity[0].Setup(Highpass, 0.5, 200, s);
//	tSensorData.HighPassVelocity[1].Setup(Highpass, 0.5, 200, s);
//	tSensorData.HighPassVelocity[2].Setup(Highpass, 0.5, 200, s);	
//	tSensorData.HighPassPosition[0].Setup(Highpass, 0.5, 200, s);
//	tSensorData.HighPassPosition[1].Setup(Highpass, 0.5, 200, s);
//	tSensorData.HighPassPosition[2].Setup(Highpass, 0.5, 200, s);

	if (ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE)
	{
		//start background adc conversion
		if( HAL_ADC_Start(&hadc1) != HAL_OK)  
			Error_Handler();
		if (HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC_Values, 3) != HAL_OK)  
			Error_Handler();
		HAL_Delay(100);
		
		//calculate analog averages
		for (int c=0; c<100; c++)
		{
			HAL_Delay(1);
			for (int i=0; i<3; i++)
				ADC_Averages[i] = (ADC_Averages[i] * 0.9f) + ((float)ADC_Values[i] * 0.1f);
		}
		for (int i=0; i<3; i++)
			ADC_Offsets[i] = ADC_Averages[i];		
	}
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	
	
	uint8_t feedRawData = 0;
	uint8_t readyToSend = 0;
	uint8_t readyToReceive = 0;
	
	Quaternion orientQuat;
	Quaternion positionQuat;
	//Quaternion gravQuat(0, 0, 0, 1);
	//RF_ReceiveMode(&hspi2, NULL); //default to receive mode			
	uint32_t lastCommandSequence = 0;
	uint32_t lastADCAverages = 0;
	uint32_t vibrationStopTime = 0;	
	uint64_t lastButtonRefresh = 0;		
	//uint64_t lastPositionIntegrateTime = 0;
	//uint64_t lastPositionSend = 0;
	DigitalValues = DigitalCache = 0;
	
	//float AccelVector[3] = {0};
	float GravityVector[3] = {0};
	float CompAccelVector[3] = {0};
	float VelocityVector[3] = {0};
	//float ComplimentaryAccelVector[3] = {0};
	//float ComplimentaryVelocityVector[3] = {0};
	USBPositionData position = {0};
	
	uint8_t sendTurn = 0;
	
//	float sensorReadings = 0;
//	float AccelReadings[3] = {0};
//	float GyroReadings[3] = {0};
//	float MagReadings[3] = {0};
	
	KalmanSingle VelocityFilter[3] = {
		KalmanSingle(0.125,32,1,0),
		KalmanSingle(0.125,32,1,0),
		KalmanSingle(0.125,32,1,0)
	};
	
	
	
	while (true)
	{		
		Blink(blinkDelay);
		blinkDelay = 1000;
		
		now = HAL_GetMicros();				
		if ((ctlSource == RIGHTCTL_SOURCE || ctlSource == LEFTCTL_SOURCE) && (now - lastADCAverages > 10))
		{
			lastADCAverages = now;
			for (int i=0; i<3; i++)
			{
				ADC_Averages[i] = (ADC_Averages[i] * 0.9f) + ((float)ADC_Values[i] * 0.1f);
				int32_t value = (int32_t)((ADC_Averages[i] - ADC_Offsets[i]) / 20.48f) ;			
				if (ADC_Cache[i] != value)
				{
					//if any analog value has changes
					ADC_Cache[i] = value;
					//hasTriggerData = true;
					buttonRetransmit = 5;					
				}
			}
			
			if (DigitalCache != DigitalValues)
			{
				//if any digital value has changes
				DigitalCache = DigitalValues;
				//hasTriggerData = true;
				buttonRetransmit = 5;
				lastButtonRefresh = now;
			}
			
			if (now - lastButtonRefresh > 500000)
			{
				//update button status every 100ms.
				buttonRetransmit++;
				lastButtonRefresh = now;
			}
		}
		
		if (vibrationStopTime && HAL_GetTick() > vibrationStopTime)			
		{
			HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
			vibrationStopTime = 0;
		}
		
		float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
		
		if (elapsedTime >= 0.005f) //update at 200hz
		{	
			hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
			hasRotationData |= readGyroData(tSensorData.Gyro.Raw); 
			hasRotationData |= readMagData(tSensorData.Mag.Raw);
					
			
			if (hasRotationData) // recalc position if still has position data to be sent
			{
				tSensorData.Accel.ProcessNew();
				tSensorData.Gyro.ProcessNew();
				tSensorData.Mag.ProcessNew();
				
