sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
				//gravQuat = gravFuse.FuseGrav(&tSensorData);

				tSensorData.TimeElapsed = elapsedTime;
				lastRotationUpdate = now;	
				orientQuat = orientFuse.FuseOrient(&tSensorData);						
				//gravQuat = orientQuat;
				//now = HAL_GetMicros();			
				if (hasPositionData | (isCalibrated && (now >= 10000000)))
				{
					//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
					//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
					{
						GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
						GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
						GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;
					
						for (int i=0; i<3; i++)
						{
							float prevAccel = CompAccelVector[i];
							float prevVelocity = VelocityVector[i];																									
							
							
							CompAccelVector[i] = tSensorData.Accel.Converted[i] - GravityVector[i];	
							float newVelocity = ((prevAccel + CompAccelVector[i]) / 2.0f) * 9.81f * elapsedTime;
//							if ((CompAccelVector[i] > 0 && prevAccel < 0) || (CompAccelVector[i] < 0 && prevAccel > 0))
//								VelocityVector[i] = (VelocityVector[i] / 2.0f) + newVelocity;	
//							else 
							if (fabs(CompAccelVector[i]) < 0.01f)
								VelocityVector[i] *= 0.9f;
							else
								VelocityVector[i] = VelocityVector[i] + newVelocity;
								
								
							
							position.Position[i] = position.Position[i] + (prevVelocity + ((VelocityVector[i] - prevVelocity) / 2.0f)) * elapsedTime * 10;				
							
							//if (fabs(VelocityVector[i] - prevVelocity) < 0.05f)
							//	VelocityVector[i] *= 0.9f;
						}	
						
						//if (now - lastPositionSend >= 20000) //50 ms
						{
							positionQuat.w = 0;
							positionQuat.x = position.Position[0];
							positionQuat.y = position.Position[1];
							positionQuat.z = position.Position[2];
							
							positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
							
							hasPositionData = 1;							
							//lastPositionSend = now;	
						}
						
						//lastPositionIntegrateTime = now;
					}
				}
				//else
				//	lastPositionIntegrateTime = now;
			}
		}

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				
				if (CheckPacketCrc(pUSBCommandPacket) && ((pUSBCommandPacket->Header.Type & 0x0F)) == ctlSource)
				{
					if (lastCommandSequence != pUSBCommandPacket->Header.Sequence) //discard duplicates
					{
						lastCommandSequence = pUSBCommandPacket->Header.Sequence; 
						switch (pUSBCommandPacket->Command.Command)
						{
							case CMD_RAW_DATA:								
								feedRawData = pUSBCommandPacket->Command.Data.Raw.State;
								break;
							case CMD_VIBRATE:
								vibrationStopTime = HAL_GetTick() + pUSBCommandPacket->Command.Data.Vibration.Duration;
								HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET);							
								break;
							case CMD_CALIBRATE:
								//manually set sensor offsets
								for (int i=0; i<3; i++)
								{
									position.Position[i] = 0;
									VelocityVector[i] = 0;
									//AccelVector[i] = 0;
									CompAccelVector[i] = 0;
									if (pUSBCommandPacket->Command.Data.Calibration.Sensor == SENSOR_ACCEL)
									{
										tSensorData.Accel.PosScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Accel.NegScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
									}
									if (pUSBCommandPacket->Command.Data.Calibration.Sensor == SENSOR_GYRO)
									{
										tSensorData.Gyro.PosScale[i] = pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Gyro.NegScale[i] = 0;
									}
									
									if (pUSBCommandPacket->Command.Data.Calibration.Sensor == SENSOR_MAG)
									{
										tSensorData.Mag.PosScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Mag.NegScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
									}
								}
								isCalibrated = true;
								//lastPositionIntegrateTime = 
								//lastPositionSend = now;
								break;
						}
					}
					pUSBCommandPacket->Header.Type = 0xff;				
				}									
			}
		}		
		
		if ((hasRotationData || feedRawData || hasPositionData || buttonRetransmit) && HAL_GetTick() >= nextSend)
		{
			rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;			
		}
		
		if (readyToSend)
		{
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			
			//RF_DisableTransmit(&hspi2);
			
			//rfStatus = RF_Status(&hspi2); readyToSend = (rfStatus & RF_TX_STATUS_FULL_Bit) == 0x00 ? 1 : 0;	
			sendTurn = (sendTurn + 1) % 4;
			
			//4 types of data				
			uint8_t currTurn = sendTurn;
			
			if (currTurn == 0)
			{
				if (feedRawData)
				{	
					sendTurn = currTurn;
					//send raw data
					USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Command.Command = CMD_RAW_DATA;
					USBDataPacket.Command.Data.Raw.State = feedRawData;
					for (int idx=0; idx<3; idx++)
					{
						switch(feedRawData)
						{
							case 1:
							{
								//raw sensor values
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
								break;
							}
							case 2:
							{
								//filtered sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
								break;
							}
							case 3:
							{
								//compensated sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
								break;
							}
							case 4:
							{
								//deadreckoning vectors
								USBDataPacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
								USBDataPacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
								USBDataPacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
								break;
							}
						}
					}
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;
				}
				else 
					currTurn++;
			}
			if (currTurn == 1)
			{	
				if (hasPositionData)
				{					
					sendTurn = currTurn;
					//send position
					hasPositionData = 0;				
					USBDataPacket.Header.Type = ctlSource | POSITION_DATA;
					USBDataPacket.Header.Sequence++;
					
					//remap
					USBDataPacket.Position.Position[0] = positionQuat.x; //position.Position[0];
					USBDataPacket.Position.Position[1] = positionQuat.z; //position.Position[2];
					USBDataPacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;					
				}
				else 
					currTurn++;
			} 
			if (currTurn == 2)
			{				
				if (hasRotationData)
				{			
					sendTurn = currTurn;					
					//send rot data
					hasRotationData = 0;				
					USBDataPacket.Header.Type = ctlSource | ROTATION_DATA;
					USBDataPacket.Header.Sequence++;
					//remap				
					USBDataPacket.Rotation.w = 1; //orientQuat.w;
					USBDataPacket.Rotation.x = 0; //orientQuat.x;
					USBDataPacket.Rotation.y = 0; //orientQuat.z;
					USBDataPacket.Rotation.z = 0; //-orientQuat.y;					
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;	
				}			
				else
					currTurn++;
			} 
			if (currTurn == 3)
			{
				if (buttonRetransmit)
				{			
					sendTurn = currTurn;					
					//send trigger data				
					buttonRetransmit--;				
					USBDataPacket.Header.Type = ctlSource | TRIGGER_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 200.0f;
					USBDataPacket.Trigger.Analog[0].y = 0;				
					USBDataPacket.Trigger.Analog[1].x = ((float)ADC_Cache[1]) / 100.0f;
					USBDataPacket.Trigger.Analog[1].y = ((float)ADC_Cache[2]) / 100.0f;
					USBDataPacket.Trigger.Digital = DigitalCache;
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));				
					rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;									
				}
				currTurn++;
			}			
			
			//RF_EnableTransmit(&hspi2);
			//if (!(hasRotationData | hasPositionData | buttonRetransmit | feedRawData))
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
			
			if (!(feedRawData || hasPositionData || hasRotationData || buttonRetransmit))
				nextSend = HAL_GetTick() + (extraDelay + (rand() % 10));
			readyToSend = 0;

			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
			//
			//continue;
		}
	}
  /* USER CODE END WHILE */

